## Terraform Plan - staging

#### Format Check: `success`
#### Initialization: `success`
#### Validation: `success`
#### Plan: `success`

<details><summary>Show Plan</summary>

```terraform
module.monitoring.local_file.homepage_canary_script[0]: Refreshing state... [id=ff1e5060f8dfaeb076dfc3ea62e112180260ca27]
module.monitoring.local_file.api_health_canary_script[0]: Refreshing state... [id=9a0b72dbcde2b7c081573dccc29476bb5799109a]
module.secrets.random_password.secret_key: Refreshing state... [id=none]
module.secrets.random_password.jwt_secret_key: Refreshing state... [id=none]
module.secrets.random_password.nextauth_secret: Refreshing state... [id=none]
module.rds.random_password.master: Refreshing state... [id=none]
module.s3.data.aws_caller_identity.current: Reading...
module.cloudfront.aws_cloudfront_origin_request_policy.api_all_viewer: Refreshing state... [id=142e83c3-2d34-4e61-ab04-97edc3e401fc]
module.iam.data.aws_caller_identity.current: Reading...
module.rds.aws_db_parameter_group.main: Refreshing state... [id=party-time-staging-pg16]
module.ecs.aws_cloudwatch_log_group.frontend: Refreshing state... [id=/ecs/party-time/staging/frontend]
module.cloudfront.aws_cloudfront_response_headers_policy.security_headers: Refreshing state... [id=1848f53c-340f-4228-9666-fcfbf570caed]
module.kms.data.aws_caller_identity.current: Reading...
module.monitoring.aws_xray_group.slow_requests[0]: Refreshing state... [id=arn:aws:xray:us-east-1:412381751532:group/party-time-staging-slow/OBRCLRM7LV7IPH4YWDOGD7UIX7ZQNMKGPKYUNGYESUHU7EC5K6TQ]
module.iam.aws_iam_role.ecs_task_execution: Refreshing state... [id=party-time-staging-ecs-task-execution]
module.monitoring.aws_xray_sampling_rule.main[0]: Refreshing state... [id=party-time-staging]
module.s3.data.aws_caller_identity.current: Read complete after 0s [id=412381751532]
module.cloudfront.aws_cloudfront_cache_policy.api_no_cache: Refreshing state... [id=edb1225e-bab6-4600-ad5e-a0d390eec86c]
module.iam.data.aws_caller_identity.current: Read complete after 0s [id=412381751532]
module.security.aws_guardduty_detector.main: Refreshing state... [id=50cb1b7670d56f1b728bd90418cbe7fc]
module.kms.data.aws_caller_identity.current: Read complete after 0s [id=412381751532]
module.security.data.aws_caller_identity.current: Reading...
module.security.data.aws_caller_identity.current: Read complete after 0s [id=412381751532]
module.acm.aws_acm_certificate.main: Refreshing state... [id=arn:aws:acm:us-east-1:412381751532:certificate/2103c5ff-a7e8-48ea-8b21-bbc8def08e18]
module.iam.aws_iam_openid_connect_provider.github: Refreshing state... [id=arn:aws:iam::412381751532:oidc-provider/token.actions.githubusercontent.com]
module.ecs.aws_ecs_cluster.main: Refreshing state... [id=arn:aws:ecs:us-east-1:412381751532:cluster/party-time-staging-cluster]
module.cloudfront.data.aws_cloudfront_origin_request_policy.all_viewer_except_host: Reading...
module.iam.aws_iam_role.ecs_task: Refreshing state... [id=party-time-staging-ecs-task]
module.security.aws_securityhub_account.main: Refreshing state... [id=412381751532]
module.monitoring.aws_sns_topic.info: Refreshing state... [id=arn:aws:sns:us-east-1:412381751532:party-time-staging-info-alerts]
module.iam.data.aws_region.current: Reading...
module.iam.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.ecr.aws_ecr_repository.backend: Refreshing state... [id=party-time-staging-backend]
module.security.aws_iam_role.vpc_flow_logs: Refreshing state... [id=party-time-staging-vpc-flow-logs]
module.monitoring.data.aws_caller_identity.current: Reading...
module.monitoring.aws_iam_role.synthetics[0]: Refreshing state... [id=party-time-staging-synthetics]
module.monitoring.data.aws_caller_identity.current: Read complete after 0s [id=412381751532]
module.monitoring.aws_sns_topic.warning: Refreshing state... [id=arn:aws:sns:us-east-1:412381751532:party-time-staging-warning-alerts]
module.monitoring.aws_sns_topic.critical: Refreshing state... [id=arn:aws:sns:us-east-1:412381751532:party-time-staging-critical-alerts]
module.monitoring.aws_xray_group.errors[0]: Refreshing state... [id=arn:aws:xray:us-east-1:412381751532:group/party-time-staging-errors/EMHAX3CTU3ZQM5QOI2SL4XMJ7PI5J6SNF7VW5G4INSCNFK57LPDQ]
module.networking.aws_vpc.main: Refreshing state... [id=vpc-01e1a346ee2fb2994]
module.ecr.aws_ecr_repository.celery: Refreshing state... [id=party-time-staging-celery]
module.cloudfront.data.aws_cloudfront_cache_policy.caching_optimized: Reading...
module.rds.aws_iam_role.rds_monitoring: Refreshing state... [id=party-time-staging-rds-monitoring]
module.security.aws_cloudwatch_log_group.waf[0]: Refreshing state... [id=aws-waf-logs-party-time-staging]
module.ecr.aws_ecr_repository.frontend: Refreshing state... [id=party-time-staging-frontend]
module.ecs.aws_cloudwatch_log_group.celery_beat: Refreshing state... [id=/ecs/party-time/staging/celery-beat]
module.kms.data.aws_region.current: Reading...
module.kms.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.ecs.aws_cloudwatch_log_group.backend: Refreshing state... [id=/ecs/party-time/staging/backend]
module.cloudfront.aws_cloudfront_cache_policy.nextjs_dynamic: Refreshing state... [id=e16c405b-6043-4318-835d-73bf95cc9cfd]
module.security.aws_cloudwatch_log_group.vpc_flow_logs: Refreshing state... [id=/aws/vpc/party-time-staging-flow-logs]
module.monitoring.data.aws_region.current: Reading...
module.monitoring.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.route53.data.aws_route53_zone.main: Reading...
module.elasticache.aws_elasticache_parameter_group.main: Refreshing state... [id=party-time-staging-redis7]
module.security.data.aws_region.current: Reading...
module.security.data.aws_region.current: Read complete after 0s [id=us-east-1]
module.ecs.aws_cloudwatch_log_group.celery_worker: Refreshing state... [id=/ecs/party-time/staging/celery-worker]
module.s3.aws_s3_bucket.uploads: Refreshing state... [id=party-time-staging-uploads-412381751532]
module.s3.aws_s3_bucket.assets: Refreshing state... [id=party-time-staging-assets-412381751532]
module.security.aws_s3_bucket.cloudtrail: Refreshing state... [id=party-time-staging-cloudtrail-412381751532]
module.iam.aws_iam_role.github_actions: Refreshing state... [id=party-time-staging-github-actions]
module.iam.aws_iam_role_policy_attachment.ecs_task_execution_basic: Refreshing state... [id=party-time-staging-ecs-task-execution-20251208225454627200000001]
module.iam.aws_iam_role_policy.ecs_task_execution_secrets: Refreshing state... [id=party-time-staging-ecs-task-execution:party-time-staging-ecs-task-execution-secrets]
module.kms.aws_kms_key.main: Refreshing state... [id=ddc28df9-1ecd-4a40-a571-028fc1d44dc0]
module.iam.aws_iam_role_policy.ecs_task: Refreshing state... [id=party-time-staging-ecs-task:party-time-staging-ecs-task-policy]
module.security.aws_iam_role_policy.vpc_flow_logs: Refreshing state... [id=party-time-staging-vpc-flow-logs:party-time-staging-vpc-flow-logs]
module.rds.aws_iam_role_policy_attachment.rds_monitoring: Refreshing state... [id=party-time-staging-rds-monitoring-20251209182728531700000001]
module.monitoring.aws_s3_bucket.synthetics[0]: Refreshing state... [id=party-time-staging-synthetics-412381751532]
module.s3.aws_s3_bucket_cors_configuration.uploads: Refreshing state... [id=party-time-staging-uploads-412381751532]
module.s3.aws_s3_bucket_versioning.uploads: Refreshing state... [id=party-time-staging-uploads-412381751532]
module.s3.aws_s3_bucket_public_access_block.uploads: Refreshing state... [id=party-time-staging-uploads-412381751532]
module.s3.aws_s3_bucket_lifecycle_configuration.uploads: Refreshing state... [id=party-time-staging-uploads-412381751532]
module.monitoring.aws_cloudwatch_dashboard.email: Refreshing state... [id=party-time-staging-email]
module.s3.aws_s3_bucket_lifecycle_configuration.assets: Refreshing state... [id=party-time-staging-assets-412381751532]
module.s3.aws_s3_bucket_versioning.assets: Refreshing state... [id=party-time-staging-assets-412381751532]
module.s3.aws_s3_bucket_public_access_block.assets: Refreshing state... [id=party-time-staging-assets-412381751532]
module.security.aws_s3_bucket_lifecycle_configuration.cloudtrail: Refreshing state... [id=party-time-staging-cloudtrail-412381751532]
module.security.aws_s3_bucket_versioning.cloudtrail: Refreshing state... [id=party-time-staging-cloudtrail-412381751532]
module.security.aws_s3_bucket_public_access_block.cloudtrail: Refreshing state... [id=party-time-staging-cloudtrail-412381751532]
module.security.aws_s3_bucket_server_side_encryption_configuration.cloudtrail: Refreshing state... [id=party-time-staging-cloudtrail-412381751532]
module.security.aws_s3_bucket_policy.cloudtrail: Refreshing state... [id=party-time-staging-cloudtrail-412381751532]
module.monitoring.aws_s3_bucket_public_access_block.synthetics[0]: Refreshing state... [id=party-time-staging-synthetics-412381751532]
module.monitoring.aws_synthetics_canary.api_health[0]: Refreshing state... [id=party-time-staging-api]
module.monitoring.aws_iam_role_policy.synthetics[0]: Refreshing state... [id=party-time-staging-synthetics:party-time-staging-synthetics-policy]
module.monitoring.aws_s3_bucket_lifecycle_configuration.synthetics[0]: Refreshing state... [id=party-time-staging-synthetics-412381751532]
module.monitoring.aws_synthetics_canary.homepage[0]: Refreshing state... [id=party-time-staging-home]
module.security.aws_cloudtrail.main: Refreshing state... [id=arn:aws:cloudtrail:us-east-1:412381751532:trail/party-time-staging-trail]
module.security.aws_wafv2_web_acl.main: Refreshing state... [id=c80dbc88-9200-4e8b-8d49-784789858525]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.monitoring.aws_s3_bucket.synthetics[0] has been deleted
  - resource "aws_s3_bucket" "synthetics" {
      - arn                         = "arn:aws:s3:::party-time-staging-synthetics-412381751532" -> null
        id                          = "party-time-staging-synthetics-412381751532"
        tags                        = {
            "Environment" = "staging"
            "ManagedBy"   = "terraform"
            "Name"        = "party-time-staging-synthetics"
            "Phase"       = "7"
            "Project"     = "party-time"
            "Service"     = "monitoring"
        }
        # (9 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.s3.aws_s3_bucket.assets has been deleted
  - resource "aws_s3_bucket" "assets" {
      - arn                         = "arn:aws:s3:::party-time-staging-assets-412381751532" -> null
      - bucket_regional_domain_name = "party-time-staging-assets-412381751532.s3.us-east-1.amazonaws.com" -> null
      - id                          = "party-time-staging-assets-412381751532" -> null
        tags                        = {
            "Environment" = "staging"
            "ManagedBy"   = "terraform"
            "Name"        = "party-time-staging-assets"
            "Project"     = "party-time"
            "Service"     = "storage"
        }
        # (8 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.s3.aws_s3_bucket.uploads has been deleted
  - resource "aws_s3_bucket" "uploads" {
      - arn                         = "arn:aws:s3:::party-time-staging-uploads-412381751532" -> null
      - bucket_regional_domain_name = "party-time-staging-uploads-412381751532.s3.us-east-1.amazonaws.com" -> null
      - id                          = "party-time-staging-uploads-412381751532" -> null
        tags                        = {
            "Environment" = "staging"
            "ManagedBy"   = "terraform"
            "Name"        = "party-time-staging-uploads"
            "Project"     = "party-time"
            "Service"     = "storage"
        }
        # (8 unchanged attributes hidden)

        # (7 unchanged blocks hidden)
    }

  # module.security.aws_s3_bucket.cloudtrail has been deleted
  - resource "aws_s3_bucket" "cloudtrail" {
      - arn                         = "arn:aws:s3:::party-time-staging-cloudtrail-412381751532" -> null
      - id                          = "party-time-staging-cloudtrail-412381751532" -> null
        tags                        = {
            "Environment" = "staging"
            "ManagedBy"   = "terraform"
            "Name"        = "party-time-staging-cloudtrail"
            "Project"     = "party-time"
            "Service"     = "security"
        }
        # (10 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform planned the following actions, but then encountered a problem:

  # module.monitoring.data.archive_file.api_health_canary[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "api_health_canary" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "../../modules/monitoring/canary-scripts/api-health.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "../../modules/monitoring/canary-scripts/api-health"
      + type                = "zip"
    }

  # module.monitoring.data.archive_file.homepage_canary[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "archive_file" "homepage_canary" {
      + id                  = (known after apply)
      + output_base64sha256 = (known after apply)
      + output_base64sha512 = (known after apply)
      + output_md5          = (known after apply)
      + output_path         = "../../modules/monitoring/canary-scripts/homepage.zip"
      + output_sha          = (known after apply)
      + output_sha256       = (known after apply)
      + output_sha512       = (known after apply)
      + output_size         = (known after apply)
      + source_dir          = "../../modules/monitoring/canary-scripts/homepage"
      + type                = "zip"
    }

  # module.monitoring.aws_iam_role_policy.synthetics[0] will be updated in-place
  ~ resource "aws_iam_role_policy" "synthetics" {
        id     = "party-time-staging-synthetics:party-time-staging-synthetics-policy"
        name   = "party-time-staging-synthetics-policy"
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action   = [
                          - "s3:PutObject",
                          - "s3:GetObject",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::party-time-staging-synthetics-412381751532/*"
                    },
                  - {
                      - Action   = [
                          - "s3:GetBucketLocation",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:s3:::party-time-staging-synthetics-412381751532"
                    },
                  - {
                      - Action   = [
                          - "logs:CreateLogStream",
                          - "logs:PutLogEvents",
                          - "logs:CreateLogGroup",
                        ]
                      - Effect   = "Allow"
                      - Resource = "arn:aws:logs:us-east-1:412381751532:log-group:/aws/lambda/cwsyn-*"
                    },
                  - {
                      - Action    = [
                          - "cloudwatch:PutMetricData",
                        ]
                      - Condition = {
                          - StringEquals = {
                              - "cloudwatch:namespace" = "CloudWatchSynthetics"
                            }
                        }
                      - Effect    = "Allow"
                      - Resource  = "*"
                    },
                  - {
                      - Action   = [
                          - "xray:PutTraceSegments",
                        ]
                      - Effect   = "Allow"
                      - Resource = "*"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
        # (1 unchanged attribute hidden)
    }

  # module.monitoring.aws_s3_bucket.synthetics[0] will be created
  + resource "aws_s3_bucket" "synthetics" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "party-time-staging-synthetics-412381751532"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "party-time-staging-synthetics"
          + "Phase"       = "7"
          + "Project"     = "party-time"
          + "Service"     = "monitoring"
        }
      + tags_all                    = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "party-time-staging-synthetics"
          + "Owner"       = "guido@asbun.io"
          + "Phase"       = "7"
          + "Project"     = "party-time"
          + "Service"     = "monitoring"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.monitoring.local_file.api_health_canary_script[0] will be created
  + resource "local_file" "api_health_canary_script" {
      + content              = <<-EOT
            const https = require('https');
            const synthetics = require('Synthetics');
            const log = require('SyntheticsLogger');
            
            const apiHealthCheck = async function () {
                const url = 'https://staging.celebration-time.com/health';
            
                log.info('Checking API health: ' + url);
            
                return new Promise((resolve, reject) => {
                    const urlObj = new URL(url);
            
                    const options = {
                        hostname: urlObj.hostname,
                        port: urlObj.port || 443,
                        path: urlObj.pathname,
                        method: 'GET',
                        timeout: 10000
                    };
            
                    const req = https.request(options, (res) => {
                        let data = '';
            
                        res.on('data', chunk => { data += chunk; });
            
                        res.on('end', () => {
                            log.info('Status code: ' + res.statusCode);
                            log.info('Response: ' + data);
            
                            if (res.statusCode !== 200) {
                                reject(new Error('Health check returned status: ' + res.statusCode));
                                return;
                            }
            
                            try {
                                const json = JSON.parse(data);
                                if (json.status !== 'healthy') {
                                    reject(new Error('Health check status: ' + json.status));
                                    return;
                                }
                                log.info('API health check passed');
                                resolve();
                            } catch (e) {
                                reject(new Error('Failed to parse health response: ' + e.message));
                            }
                        });
                    });
            
                    req.on('error', (e) => {
                        reject(new Error('Health check request failed: ' + e.message));
                    });
            
                    req.on('timeout', () => {
                        req.destroy();
                        reject(new Error('Health check request timed out'));
                    });
            
                    req.end();
                });
            };
            
            exports.handler = async () => {
                return await apiHealthCheck();
            };
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../../modules/monitoring/canary-scripts/api-health/nodejs/node_modules/index.js"
      + id                   = (known after apply)
    }

  # module.monitoring.local_file.homepage_canary_script[0] will be created
  + resource "local_file" "homepage_canary_script" {
      + content              = <<-EOT
            const { URL } = require('url');
            const synthetics = require('Synthetics');
            const log = require('SyntheticsLogger');
            
            const pageLoadBlueprint = async function () {
                const url = 'https://staging.celebration-time.com/';
            
                log.info('Loading page: ' + url);
            
                let page = await synthetics.getPage();
            
                const response = await page.goto(url, {
                    waitUntil: 'domcontentloaded',
                    timeout: 30000
                });
            
                const statusCode = response.status();
                log.info('Status code: ' + statusCode);
            
                if (statusCode !== 200) {
                    throw new Error('Homepage returned status: ' + statusCode);
                }
            
                // Check for page title
                const title = await page.title();
                log.info('Page title: ' + title);
            
                log.info('Homepage loaded successfully');
            };
            
            exports.handler = async () => {
                return await pageLoadBlueprint();
            };
        EOT
      + content_base64sha256 = (known after apply)
      + content_base64sha512 = (known after apply)
      + content_md5          = (known after apply)
      + content_sha1         = (known after apply)
      + content_sha256       = (known after apply)
      + content_sha512       = (known after apply)
      + directory_permission = "0777"
      + file_permission      = "0777"
      + filename             = "../../modules/monitoring/canary-scripts/homepage/nodejs/node_modules/index.js"
      + id                   = (known after apply)
    }

  # module.s3.aws_s3_bucket.assets will be created
  + resource "aws_s3_bucket" "assets" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "party-time-staging-assets-412381751532"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "party-time-staging-assets"
          + "Project"     = "party-time"
          + "Service"     = "storage"
        }
      + tags_all                    = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "party-time-staging-assets"
          + "Owner"       = "guido@asbun.io"
          + "Project"     = "party-time"
          + "Service"     = "storage"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3.aws_s3_bucket.uploads will be created
  + resource "aws_s3_bucket" "uploads" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "party-time-staging-uploads-412381751532"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "party-time-staging-uploads"
          + "Project"     = "party-time"
          + "Service"     = "storage"
        }
      + tags_all                    = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "party-time-staging-uploads"
          + "Owner"       = "guido@asbun.io"
          + "Project"     = "party-time"
          + "Service"     = "storage"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.s3.aws_s3_bucket_cors_configuration.uploads must be replaced
-/+ resource "aws_s3_bucket_cors_configuration" "uploads" {
      ~ bucket = "party-time-staging-uploads-412381751532" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "party-time-staging-uploads-412381751532" -> (known after apply)

        # (1 unchanged block hidden)
    }

  # module.s3.aws_s3_bucket_versioning.assets must be replaced
-/+ resource "aws_s3_bucket_versioning" "assets" {
      ~ bucket = "party-time-staging-assets-412381751532" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "party-time-staging-assets-412381751532" -> (known after apply)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.s3.aws_s3_bucket_versioning.uploads must be replaced
-/+ resource "aws_s3_bucket_versioning" "uploads" {
      ~ bucket = "party-time-staging-uploads-412381751532" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "party-time-staging-uploads-412381751532" -> (known after apply)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

  # module.security.aws_s3_bucket.cloudtrail will be created
  + resource "aws_s3_bucket" "cloudtrail" {
      + acceleration_status         = (known after apply)
      + acl                         = (known after apply)
      + arn                         = (known after apply)
      + bucket                      = "party-time-staging-cloudtrail-412381751532"
      + bucket_domain_name          = (known after apply)
      + bucket_prefix               = (known after apply)
      + bucket_regional_domain_name = (known after apply)
      + force_destroy               = false
      + hosted_zone_id              = (known after apply)
      + id                          = (known after apply)
      + object_lock_enabled         = (known after apply)
      + policy                      = (known after apply)
      + region                      = (known after apply)
      + request_payer               = (known after apply)
      + tags                        = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "party-time-staging-cloudtrail"
          + "Project"     = "party-time"
          + "Service"     = "security"
        }
      + tags_all                    = {
          + "Environment" = "staging"
          + "ManagedBy"   = "terraform"
          + "Name"        = "party-time-staging-cloudtrail"
          + "Owner"       = "guido@asbun.io"
          + "Project"     = "party-time"
          + "Service"     = "security"
        }
      + website_domain              = (known after apply)
      + website_endpoint            = (known after apply)
    }

  # module.security.aws_s3_bucket_policy.cloudtrail must be replaced
-/+ resource "aws_s3_bucket_policy" "cloudtrail" {
      ~ bucket = "party-time-staging-cloudtrail-412381751532" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "party-time-staging-cloudtrail-412381751532" -> (known after apply)
      ~ policy = jsonencode(
            {
              - Statement = [
                  - {
                      - Action    = "s3:GetBucketAcl"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudtrail:us-east-1:412381751532:trail/party-time-staging-trail"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudtrail.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::party-time-staging-cloudtrail-412381751532"
                      - Sid       = "AWSCloudTrailAclCheck"
                    },
                  - {
                      - Action    = "s3:PutObject"
                      - Condition = {
                          - StringEquals = {
                              - "AWS:SourceArn" = "arn:aws:cloudtrail:us-east-1:412381751532:trail/party-time-staging-trail"
                              - "s3:x-amz-acl"  = "bucket-owner-full-control"
                            }
                        }
                      - Effect    = "Allow"
                      - Principal = {
                          - Service = "cloudtrail.amazonaws.com"
                        }
                      - Resource  = "arn:aws:s3:::party-time-staging-cloudtrail-412381751532/*"
                      - Sid       = "AWSCloudTrailWrite"
                    },
                ]
              - Version   = "2012-10-17"
            }
        ) -> (known after apply)
    }

  # module.security.aws_s3_bucket_versioning.cloudtrail must be replaced
-/+ resource "aws_s3_bucket_versioning" "cloudtrail" {
      ~ bucket = "party-time-staging-cloudtrail-412381751532" # forces replacement -> (known after apply) # forces replacement
      ~ id     = "party-time-staging-cloudtrail-412381751532" -> (known after apply)

      ~ versioning_configuration {
          + mfa_delete = (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

Plan: 11 to add, 1 to change, 5 to destroy.

Changes to Outputs:
  ~ assets_bucket_arn           = "arn:aws:s3:::party-time-staging-assets-412381751532" -> (known after apply)
  ~ assets_bucket_id            = "party-time-staging-assets-412381751532" -> (known after apply)
  ~ cloudtrail_s3_bucket_id     = "party-time-staging-cloudtrail-412381751532" -> (known after apply)
  ~ uploads_bucket_arn          = "arn:aws:s3:::party-time-staging-uploads-412381751532" -> (known after apply)
  ~ uploads_bucket_id           = "party-time-staging-uploads-412381751532" -> (known after apply)

Warning: Invalid Attribute Combination

  with module.monitoring.aws_s3_bucket_lifecycle_configuration.synthetics,
  on ../../modules/monitoring/synthetics.tf line 104, in resource "aws_s3_bucket_lifecycle_configuration" "synthetics":
 104: resource "aws_s3_bucket_lifecycle_configuration" "synthetics" {

No attribute specified when one (and only one) of
[rule[0].filter,rule[0].prefix] is required

This will be an error in a future version of the provider

Error: reading CloudFront Response Headers Policy (1848f53c-340f-4228-9666-fcfbf570caed): operation error CloudFront: GetResponseHeadersPolicy, https response error StatusCode: 403, RequestID: e38c0f8e-3563-4ff4-931d-e7a13536b08b, AccessDenied: User: arn:aws:sts::412381751532:assumed-role/party-time-staging-github-actions/GitHubActions is not authorized to perform: cloudfront:GetResponseHeadersPolicy on resource: arn:aws:cloudfront::412381751532:response-headers-policy/1848f53c-340f-4228-9666-fcfbf570caed because no identity-based policy allows the cloudfront:GetResponseHeadersPolicy action

  with module.cloudfront.aws_cloudfront_response_headers_policy.security_headers,
  on ../../modules/cloudfront/main.tf line 14, in resource "aws_cloudfront_response_headers_policy" "security_headers":
  14: resource "aws_cloudfront_response_headers_policy" "security_headers" {


Error: reading CloudFront Cache Policy (edb1225e-bab6-4600-ad5e-a0d390eec86c): operation error CloudFront: GetCachePolicy, https response error StatusCode: 403, RequestID: 5905f8e9-dcbc-402f-a27a-6021e95c33e9, AccessDenied: User: arn:aws:sts::412381751532:assumed-role/party-time-staging-github-actions/GitHubActions is not authorized to perform: cloudfront:GetCachePolicy on resource: arn:aws:cloudfront::412381751532:cache-policy/edb1225e-bab6-4600-ad5e-a0d390eec86c because no identity-based policy allows the cloudfront:GetCachePolicy action

  with module.cloudfront.aws_cloudfront_cache_policy.api_no_cache,
  on ../../modules/cloudfront/main.tf line 83, in resource "aws_cloudfront_cache_policy" "api_no_cache":
  83: resource "aws_cloudfront_cache_policy" "api_no_cache" {


Error: reading CloudFront Cache Policy (e16c405b-6043-4318-835d-73bf95cc9cfd): operation error CloudFront: GetCachePolicy, https response error StatusCode: 403, RequestID: d1f7c710-362d-4895-9e21-7bd69c5171d4, AccessDenied: User: arn:aws:sts::412381751532:assumed-role/party-time-staging-github-actions/GitHubActions is not authorized to perform: cloudfront:GetCachePolicy on resource: arn:aws:cloudfront::412381751532:cache-policy/e16c405b-6043-4318-835d-73bf95cc9cfd because no identity-based policy allows the cloudfront:GetCachePolicy action

  with module.cloudfront.aws_cloudfront_cache_policy.nextjs_dynamic,
  on ../../modules/cloudfront/main.tf line 108, in resource "aws_cloudfront_cache_policy" "nextjs_dynamic":
 108: resource "aws_cloudfront_cache_policy" "nextjs_dynamic" {


Error: reading CloudFront Origin Request Policy (142e83c3-2d34-4e61-ab04-97edc3e401fc): operation error CloudFront: GetOriginRequestPolicy, https response error StatusCode: 403, RequestID: 16ecb6ec-4064-415c-9ca8-86948fbed20d, AccessDenied: User: arn:aws:sts::412381751532:assumed-role/party-time-staging-github-actions/GitHubActions is not authorized to perform: cloudfront:GetOriginRequestPolicy on resource: arn:aws:cloudfront::412381751532:origin-request-policy/142e83c3-2d34-4e61-ab04-97edc3e401fc because no identity-based policy allows the cloudfront:GetOriginRequestPolicy action

  with module.cloudfront.aws_cloudfront_origin_request_policy.api_all_viewer,
  on ../../modules/cloudfront/main.tf line 135, in resource "aws_cloudfront_origin_request_policy" "api_all_viewer":
 135: resource "aws_cloudfront_origin_request_policy" "api_all_viewer" {


Error: listing CloudFront Cache Policies: operation error CloudFront: ListCachePolicies, https response error StatusCode: 403, RequestID: d365ea38-ec3b-4ecc-8afe-83fe7b726b37, AccessDenied: User: arn:aws:sts::412381751532:assumed-role/party-time-staging-github-actions/GitHubActions is not authorized to perform: cloudfront:ListCachePolicies on resource: arn:aws:cloudfront::412381751532:cache-policy/* because no identity-based policy allows the cloudfront:ListCachePolicies action

  with module.cloudfront.data.aws_cloudfront_cache_policy.caching_optimized,
  on ../../modules/cloudfront/main.tf line 333, in data "aws_cloudfront_cache_policy" "caching_optimized":
 333: data "aws_cloudfront_cache_policy" "caching_optimized" {


Error: listing CloudFront Origin Request Policies: operation error CloudFront: ListOriginRequestPolicies, https response error StatusCode: 403, RequestID: 4f0cf462-aa54-4455-afe4-5ab54bf96044, AccessDenied: User: arn:aws:sts::412381751532:assumed-role/party-time-staging-github-actions/GitHubActions is not authorized to perform: cloudfront:ListOriginRequestPolicies on resource: arn:aws:cloudfront::412381751532:origin-request-policy/* because no identity-based policy allows the cloudfront:ListOriginRequestPolicies action

  with module.cloudfront.data.aws_cloudfront_origin_request_policy.all_viewer_except_host,
  on ../../modules/cloudfront/main.tf line 337, in data "aws_cloudfront_origin_request_policy" "all_viewer_except_host":
 337: data "aws_cloudfront_origin_request_policy" "all_viewer_except_host" {


Error: reading ECR Repository (party-time-staging-frontend): operation error ECR: DescribeRepositories, https response error StatusCode: 400, RequestID: 1c8ed800-4c00-475a-a746-35272eecb6d0, api error AccessDeniedException: User: arn:aws:sts::412381751532:assumed-role/party-time-staging-github-actions/GitHubActions is not authorized to perform: ecr:DescribeRepositories on resource: arn:aws:ecr:us-east-1:412381751532:repository/party-time-staging-frontend because no identity-based policy allows the ecr:DescribeRepositories action

  with module.ecr.aws_ecr_repository.frontend,
  on ../../modules/ecr/main.tf line 8, in resource "aws_ecr_repository" "frontend":
   8: resource "aws_ecr_repository" "frontend" {


Error: reading ECR Repository (party-time-staging-backend): operation error ECR: DescribeRepositories, https response error StatusCode: 400, RequestID: 9e5181ee-545f-4ecd-99cc-0ff78b5d5b22, api error AccessDeniedException: User: arn:aws:sts::412381751532:assumed-role/party-time-staging-github-actions/GitHubActions is not authorized to perform: ecr:DescribeRepositories on resource: arn:aws:ecr:us-east-1:412381751532:repository/party-time-staging-backend because no identity-based policy allows the ecr:DescribeRepositories action

  with module.ecr.aws_ecr_repository.backend,
  on ../../modules/ecr/main.tf line 29, in resource "aws_ecr_repository" "backend":
  29: resource "aws_ecr_repository" "backend" {


Error: reading ECR Repository (party-time-staging-celery): operation error ECR: DescribeRepositories, https response error StatusCode: 400, RequestID: 28d6da25-aaa0-43fb-aaca-d691e5ea157f, api error AccessDeniedException: User: arn:aws:sts::412381751532:assumed-role/party-time-staging-github-actions/GitHubActions is not authorized to perform: ecr:DescribeRepositories on resource: arn:aws:ecr:us-east-1:412381751532:repository/party-time-staging-celery because no identity-based policy allows the ecr:DescribeRepositories action

  with module.ecr.aws_ecr_repository.celery,
  on ../../modules/ecr/main.tf line 50, in resource "aws_ecr_repository" "celery":
  50: resource "aws_ecr_repository" "celery" {


Error: reading ECS Cluster (arn:aws:ecs:us-east-1:412381751532:cluster/party-time-staging-cluster): operation error ECS: DescribeClusters, https response error StatusCode: 400, RequestID: 4c2ac5ca-7dad-41fb-8793-156fb10bc29e, api error AccessDeniedException: User: arn:aws:sts::412381751532:assumed-role/party-time-staging-github-actions/GitHubActions is not authorized to perform: ecs:DescribeClusters on resource: arn:aws:ecs:us-east-1:412381751532:cluster/party-time-staging-cluster because no identity-based policy allows the ecs:DescribeClusters action

  with module.ecs.aws_ecs_cluster.main,
  on ../../modules/ecs/main.tf line 12, in resource "aws_ecs_cluster" "main":
  12: resource "aws_ecs_cluster" "main" {


Error: listing tags for CloudWatch Logs Log Group (arn:aws:logs:us-east-1:412381751532:log-group:/ecs/party-time/staging/frontend): operation error CloudWatch Logs: ListTagsForResource, https response error StatusCode: 400, RequestID: 0976a773-ea92-47c5-a811-e68b1baf0c99, api error AccessDeniedException: User: arn:aws:sts::412381751532:assumed-role/party-time-staging-github-actions/GitHubActions is not authorized to perform: logs:ListTagsForResource on resource: arn:aws:logs:us-east-1:412381751532:log-group:/ecs/party-time/staging/frontend because no identity-based policy allows the logs:ListTagsForResource action

  with module.ecs.aws_cloudwatch_log_group.frontend,
  on ../../modules/ecs/main.tf line 46, in resource "aws_cloudwatch_log_group" "frontend":
  46: resource "aws_cloudwatch_log_group" "frontend" {


Error: listing tags for CloudWatch Logs Log Group (arn:aws:logs:us-east-1:412381751532:log-group:/ecs/party-time/staging/backend): operation error CloudWatch Logs: ListTagsForResource, https response error StatusCode: 400, RequestID: da851e14-dc20-4c00-a7a1-5dde96b94f90, api error AccessDeniedException: User: arn:aws:sts::412381751532:assumed-role/party-time-staging-github-actions/GitHubActions is not authorized to perform: logs:ListTagsForResource on resource: arn:aws:logs:us-east-1:412381751532:log-group:/ecs/party-time/staging/backend because no identity-based policy allows the logs:ListTagsForResource action

  with module.ecs.aws_cloudwatch_log_group.backend,
  on ../../modules/ecs/main.tf line 58, in resource "aws_cloudwatch_log_group" "backend":
  58: resource "aws_cloudwatch_log_group" "backend" {


Error: listing tags for CloudWatch Logs Log Group (arn:aws:logs:us-east-1:412381751532:log-group:/ecs/party-time/staging/celery-worker): operation error CloudWatch Logs: ListTagsForResource, https response error StatusCode: 400, RequestID: 96e4881a-c0b4-4f79-8491-6f7f48f4f4db, api error AccessDeniedException: User: arn:aws:sts::412381751532:assumed-role/party-time-staging-github-actions/GitHubActions is not authorized to perform: logs:ListTagsForResource on resource: arn:aws:logs:us-east-1:412381751532:log-group:/ecs/party-time/staging/celery-worker because no identity-based policy allows the logs:ListTagsForResource action

  with module.ecs.aws_cloudwatch_log_group.celery_worker,
  on ../../modules/ecs/main.tf line 70, in resource "aws_cloudwatch_log_group" "celery_worker":
  70: resource "aws_cloudwatch_log_group" "celery_worker" {


Error: listing tags for CloudWatch Logs Log Group (arn:aws:logs:us-east-1:412381751532:log-group:/ecs/party-time/staging/celery-beat): operation error CloudWatch Logs: ListTagsForResource, https response error StatusCode: 400, RequestID: a413564d-db0f-49d0-9a4d-4eeb631c5508, api error AccessDeniedException: User: arn:aws:sts::412381751532:assumed-role/party-time-staging-github-actions/GitHubActions is not authorized to perform: logs:ListTagsForResource on resource: arn:aws:logs:us-east-1:412381751532:log-group:/ecs/party-time/staging/celery-beat because no identity-based policy allows the logs:ListTagsForResource action

  with module.ecs.aws_cloudwatch_log_group.celery_beat,
  on ../../modules/ecs/main.tf line 82, in resource "aws_cloudwatch_log_group" "celery_beat":
  82: resource "aws_cloudwatch_log_group" "celery_beat" {


Error: reading KMS Key (ddc28df9-1ecd-4a40-a571-028fc1d44dc0): reading KMS Key (ddc28df9-1ecd-4a40-a571-028fc1d44dc0) rotation enabled: operation error KMS: GetKeyRotationStatus, https response error StatusCode: 400, RequestID: 8e1f38d5-4b91-4398-b7c7-0830537c3c40, api error AccessDeniedException: User: arn:aws:sts::412381751532:assumed-role/party-time-staging-github-actions/GitHubActions is not authorized to perform: kms:GetKeyRotationStatus on resource: arn:aws:kms:us-east-1:412381751532:key/ddc28df9-1ecd-4a40-a571-028fc1d44dc0 because no identity-based policy allows the kms:GetKeyRotationStatus action

  with module.kms.aws_kms_key.main,
  on ../../modules/kms/main.tf line 12, in resource "aws_kms_key" "main":
  12: resource "aws_kms_key" "main" {


Error: reading CloudWatch Dashboard (party-time-staging-email): operation error CloudWatch: GetDashboard, https response error StatusCode: 403, RequestID: 702a9004-8bf9-4681-a671-4a9916ae2e9a, api error AccessDenied: User: arn:aws:sts::412381751532:assumed-role/party-time-staging-github-actions/GitHubActions is not authorized to perform: cloudwatch:GetDashboard on resource: arn:aws:cloudwatch::412381751532:dashboard/party-time-staging-email because no identity-based policy allows the cloudwatch:GetDashboard action

  with module.monitoring.aws_cloudwatch_dashboard.email,
  on ../../modules/monitoring/dashboards.tf line 433, in resource "aws_cloudwatch_dashboard" "email":
 433: resource "aws_cloudwatch_dashboard" "email" {


Error: reading SNS Topic (arn:aws:sns:us-east-1:412381751532:party-time-staging-critical-alerts): operation error SNS: GetTopicAttributes, https response error StatusCode: 403, RequestID: c6d162fa-07fd-5f73-b5f7-034089d1e608, AuthorizationError: User: arn:aws:sts::412381751532:assumed-role/party-time-staging-github-actions/GitHubActions is not authorized to perform: SNS:GetTopicAttributes on resource: arn:aws:sns:us-east-1:412381751532:party-time-staging-critical-alerts because no identity-based policy allows the SNS:GetTopicAttributes action

  with module.monitoring.aws_sns_topic.critical,
  on ../../modules/monitoring/sns.tf line 14, in resource "aws_sns_topic" "critical":
  14: resource "aws_sns_topic" "critical" {


Error: reading SNS Topic (arn:aws:sns:us-east-1:412381751532:party-time-staging-warning-alerts): operation error SNS: GetTopicAttributes, https response error StatusCode: 403, RequestID: 52105937-9088-5f4e-a541-388d1ea464b6, AuthorizationError: User: arn:aws:sts::412381751532:assumed-role/party-time-staging-github-actions/GitHubActions is not authorized to perform: SNS:GetTopicAttributes on resource: arn:aws:sns:us-east-1:412381751532:party-time-staging-warning-alerts because no identity-based policy allows the SNS:GetTopicAttributes action

  with module.monitoring.aws_sns_topic.warning,
  on ../../modules/monitoring/sns.tf line 35, in resource "aws_sns_topic" "warning":
  35: resource "aws_sns_topic" "warning" {


Error: reading SNS Topic (arn:aws:sns:us-east-1:412381751532:party-time-staging-info-alerts): operation error SNS: GetTopicAttributes, https response error StatusCode: 403, RequestID: 83ea49d8-31fe-5cf3-8d3c-2862bfd2370b, AuthorizationError: User: arn:aws:sts::412381751532:assumed-role/party-time-staging-github-actions/GitHubActions is not authorized to perform: SNS:GetTopicAttributes on resource: arn:aws:sns:us-east-1:412381751532:party-time-staging-info-alerts because no identity-based policy allows the SNS:GetTopicAttributes action

  with module.monitoring.aws_sns_topic.info,
  on ../../modules/monitoring/sns.tf line 56, in resource "aws_sns_topic" "info":
  56: resource "aws_sns_topic" "info" {


Error: reading S3 Bucket Lifecycle Configuration (party-time-staging-synthetics-412381751532)

  with module.monitoring.aws_s3_bucket_lifecycle_configuration.synthetics[0],
  on ../../modules/monitoring/synthetics.tf line 104, in resource "aws_s3_bucket_lifecycle_configuration" "synthetics":
 104: resource "aws_s3_bucket_lifecycle_configuration" "synthetics" {

operation error S3: GetBucketLifecycleConfiguration, https response error
StatusCode: 403, RequestID: 1TETVD8BZ1BVGTZQ, HostID:
7PNFztKPOyEpnM2e351sLhc9jjbNlEhdWLQGCEJtjl7iCBfufM0FaKZqpSwxnyL+Lh3s31TXWQtazWRPE3vq1hns3lL4SVay,
api error AccessDenied: User:
arn:aws:sts::412381751532:assumed-role/party-time-staging-github-actions/GitHubActions
is not authorized to perform: s3:GetLifecycleConfiguration on resource:
"arn:aws:s3:::party-time-staging-synthetics-412381751532" because no
identity-based policy allows the s3:GetLifecycleConfiguration action

Error: reading S3 Bucket Public Access Block (party-time-staging-synthetics-412381751532): operation error S3: GetPublicAccessBlock, https response error StatusCode: 403, RequestID: 1TEMTZ453DKV3B0A, HostID: xIY9xAbvbXkyTAeS/xw9ahjDLvKUCg7vllWFxTQ2mkDXUc+bxqxJ0Kwo8zTH0sUENaYwda97SQT684CpsNZV8GVhh89oCT3y, api error AccessDenied: User: arn:aws:sts::412381751532:assumed-role/party-time-staging-github-actions/GitHubActions is not authorized to perform: s3:GetBucketPublicAccessBlock on resource: "arn:aws:s3:::party-time-staging-synthetics-412381751532" because no identity-based policy allows the s3:GetBucketPublicAccessBlock action

  with module.monitoring.aws_s3_bucket_public_access_block.synthetics[0],
  on ../../modules/monitoring/synthetics.tf line 118, in resource "aws_s3_bucket_public_access_block" "synthetics":
 118: resource "aws_s3_bucket_public_access_block" "synthetics" {


Error: reading Synthetics Canary (party-time-staging-home): operation error synthetics: GetCanary, https response error StatusCode: 403, RequestID: d98cd5ed-abea-4bf9-95bf-d46eb658d65b, api error AccessDeniedException: User: arn:aws:sts::412381751532:assumed-role/party-time-staging-github-actions/GitHubActions is not authorized to perform: synthetics:GetCanary on resource: arn:aws:synthetics:us-east-1:412381751532:canary:party-time-staging-home because no identity-based policy allows the synthetics:GetCanary action

  with module.monitoring.aws_synthetics_canary.homepage[0],
  on ../../modules/monitoring/synthetics.tf line 132, in resource "aws_synthetics_canary" "homepage":
 132: resource "aws_synthetics_canary" "homepage" {


Error: reading Synthetics Canary (party-time-staging-api): operation error synthetics: GetCanary, https response error StatusCode: 403, RequestID: 93e2a9e1-4cdb-4aad-9ac4-24254335fbb0, api error AccessDeniedException: User: arn:aws:sts::412381751532:assumed-role/party-time-staging-github-actions/GitHubActions is not authorized to perform: synthetics:GetCanary on resource: arn:aws:synthetics:us-east-1:412381751532:canary:party-time-staging-api because no identity-based policy allows the synthetics:GetCanary action

  with module.monitoring.aws_synthetics_canary.api_health[0],
  on ../../modules/monitoring/synthetics.tf line 212, in resource "aws_synthetics_canary" "api_health":
 212: resource "aws_synthetics_canary" "api_health" {


Error: reading XRay Sampling Rule (party-time-staging): operation error XRay: GetSamplingRules, https response error StatusCode: 403, RequestID: dfea76ff-51f2-4075-82eb-f7f4ef587640, api error AccessDeniedException: User: arn:aws:sts::412381751532:assumed-role/party-time-staging-github-actions/GitHubActions is not authorized to perform: xray:GetSamplingRules because no identity-based policy allows the xray:GetSamplingRules action

  with module.monitoring.aws_xray_sampling_rule.main[0],
  on ../../modules/monitoring/xray.tf line 14, in resource "aws_xray_sampling_rule" "main":
  14: resource "aws_xray_sampling_rule" "main" {


Error: reading XRay Group (arn:aws:xray:us-east-1:412381751532:group/party-time-staging-errors/EMHAX3CTU3ZQM5QOI2SL4XMJ7PI5J6SNF7VW5G4INSCNFK57LPDQ): operation error XRay: GetGroup, https response error StatusCode: 403, RequestID: 9bf563fb-3841-4204-9286-84676a96f7c3, api error AccessDeniedException: User: arn:aws:sts::412381751532:assumed-role/party-time-staging-github-actions/GitHubActions is not authorized to perform: xray:GetGroup on resource: arn:aws:xray:us-east-1:412381751532:group/party-time-staging-errors/EMHAX3CTU3ZQM5QOI2SL4XMJ7PI5J6SNF7VW5G4INSCNFK57LPDQ because no identity-based policy allows the xray:GetGroup action

  with module.monitoring.aws_xray_group.errors[0],
  on ../../modules/monitoring/xray.tf line 40, in resource "aws_xray_group" "errors":
  40: resource "aws_xray_group" "errors" {


Error: reading XRay Group (arn:aws:xray:us-east-1:412381751532:group/party-time-staging-slow/OBRCLRM7LV7IPH4YWDOGD7UIX7ZQNMKGPKYUNGYESUHU7EC5K6TQ): operation error XRay: GetGroup, https response error StatusCode: 403, RequestID: 8d579c91-9527-4e40-bf80-e98af40c96fa, api error AccessDeniedException: User: arn:aws:sts::412381751532:assumed-role/party-time-staging-github-actions/GitHubActions is not authorized to perform: xray:GetGroup on resource: arn:aws:xray:us-east-1:412381751532:group/party-time-staging-slow/OBRCLRM7LV7IPH4YWDOGD7UIX7ZQNMKGPKYUNGYESUHU7EC5K6TQ because no identity-based policy allows the xray:GetGroup action

  with module.monitoring.aws_xray_group.slow_requests[0],
  on ../../modules/monitoring/xray.tf line 60, in resource "aws_xray_group" "slow_requests":
  60: resource "aws_xray_group" "slow_requests" {


Error: reading EC2 VPC (vpc-01e1a346ee2fb2994) Attribute (enableDnsHostnames): operation error EC2: DescribeVpcAttribute, https response error StatusCode: 403, RequestID: 6446da58-17b3-4839-83c8-a8d470f64ef9, api error UnauthorizedOperation: You are not authorized to perform this operation. User: arn:aws:sts::412381751532:assumed-role/party-time-staging-github-actions/GitHubActions is not authorized to perform: ec2:DescribeVpcAttribute on resource: arn:aws:ec2:us-east-1:412381751532:vpc/vpc-01e1a346ee2fb2994 because no identity-based policy allows the ec2:DescribeVpcAttribute action. Encoded authorization failure message: QfE0auHuDafmOiHS_DqGYvyO9cz5r0831xo51ncWAKeIrw9xOXRUNGAf03uLM9Hr1iX6c5IANH81n9h-mUhlPcSjTK_hcgZzG8AFmSKM85ltLJuqTLSn5EkZlgFgIjjJtVKs96hsshPP0OTJsntvBywkTOBIxIc6V1RZwF303YEt7srykfS5F0-gjH2UFdCPjKqYmPRRopxxXAcE60I6NelajcNDYa7v0ZKQ_wzcnIy8Eq3DgxmVeHvzVsUhELmyZ5LMQOcXkBWsDT4GDJjSu1-_NNdoFOaKNE_tlXZW_1ONE4vHZP_YWD4fFvqnqMOolplsxsDMsDEm-MJG33AOKg9Spb_xqevfSadN2ExuKA-TqXCIypraWeQuuQiA_K6DiuPXh1ko3eCSoR9bAMvJRyVsPFVolvjxSbFcKvBfLSSiy2gwIQmfQMD4-wrdOWTQRQ1t0Hy9KEt2EMifSd_VCOdw30hn1ELz7ZAj5EgvLWZMiAFoZJfsgNPncrUi-29ajpEhIdom5_81wnruLdgyOD2ehwAxXDjGwDc95nq8_W2TvDJZy46gvKK1hkUMATAUm-3akwdUTk0mKCe2kqcR2ne5-xZNRtoGKW-ZYYSMXNVuDtHqaQ7HLJp1YF-lqFrYnK1ANloeTR6qHWZxZdCbt44JrKwi8bfAmki60_uo9SO6NzR4zTgHz_Kaw2hB7xm0t-OHyES3O8iv0avoCn8EpJpCNXvs2dNXZfZG8uPftyOxk66j8kJ9cokdslu6Yaonh3IXUzOZ04A

  with module.networking.aws_vpc.main,
  on ../../modules/networking/main.tf line 7, in resource "aws_vpc" "main":
   7: resource "aws_vpc" "main" {


Error: reading RDS DB Parameter Group (party-time-staging-pg16): operation error RDS: DescribeDBParameterGroups, https response error StatusCode: 403, RequestID: b1dbf645-3e23-4544-8f4f-d8e8ffd7146d, api error AccessDenied: User: arn:aws:sts::412381751532:assumed-role/party-time-staging-github-actions/GitHubActions is not authorized to perform: rds:DescribeDBParameterGroups on resource: arn:aws:rds:us-east-1:412381751532:pg:party-time-staging-pg16 because no identity-based policy allows the rds:DescribeDBParameterGroups action

  with module.rds.aws_db_parameter_group.main,
  on ../../modules/rds/main.tf line 18, in resource "aws_db_parameter_group" "main":
  18: resource "aws_db_parameter_group" "main" {


Error: listing Route 53 Hosted Zone (Z059688014D054YF4WXUE) tags: operation error Route 53: ListTagsForResource, https response error StatusCode: 403, RequestID: 799b61b6-5e78-4647-a302-23b73e8b3419, api error AccessDenied: User: arn:aws:sts::412381751532:assumed-role/party-time-staging-github-actions/GitHubActions is not authorized to perform: route53:ListTagsForResource on resource: arn:aws:route53:::hostedzone/Z059688014D054YF4WXUE because no identity-based policy allows the route53:ListTagsForResource action

  with module.route53.data.aws_route53_zone.main,
  on ../../modules/route53/main.tf line 13, in data "aws_route53_zone" "main":
  13: data "aws_route53_zone" "main" {


Error: reading S3 Bucket Public Access Block (party-time-staging-assets-412381751532): operation error S3: GetPublicAccessBlock, https response error StatusCode: 403, RequestID: 1TEXHJRBJ69DZ9Y7, HostID: noB/ONy0VpwDjrEYp3XNDWpShn869xamDi0jef1fml4H9drJPAIVpkQzGk3fmK1ES6WxDjEeK+idq6NwQFK49PI2rF7vLt9U, api error AccessDenied: User: arn:aws:sts::412381751532:assumed-role/party-time-staging-github-actions/GitHubActions is not authorized to perform: s3:GetBucketPublicAccessBlock on resource: "arn:aws:s3:::party-time-staging-assets-412381751532" because no identity-based policy allows the s3:GetBucketPublicAccessBlock action

  with module.s3.aws_s3_bucket_public_access_block.assets,
  on ../../modules/s3/main.tf line 41, in resource "aws_s3_bucket_public_access_block" "assets":
  41: resource "aws_s3_bucket_public_access_block" "assets" {


Error: reading S3 Bucket Lifecycle Configuration (party-time-staging-assets-412381751532)

  with module.s3.aws_s3_bucket_lifecycle_configuration.assets,
  on ../../modules/s3/main.tf line 50, in resource "aws_s3_bucket_lifecycle_configuration" "assets":
  50: resource "aws_s3_bucket_lifecycle_configuration" "assets" {

operation error S3: GetBucketLifecycleConfiguration, https response error
StatusCode: 403, RequestID: 1TEHGJ0FBB2BHDE2, HostID:
dvhBM0OkHGN6O2PktOiCUCLhyzksAncNcQYpS0rzURTWLyUk+C19DGZMTimnnKcszHZCWeWPmnJSirSkTZH5f8gFr0Yjb+Hq,
api error AccessDenied: User:
arn:aws:sts::412381751532:assumed-role/party-time-staging-github-actions/GitHubActions
is not authorized to perform: s3:GetLifecycleConfiguration on resource:
"arn:aws:s3:::party-time-staging-assets-412381751532" because no
identity-based policy allows the s3:GetLifecycleConfiguration action

Error: reading S3 Bucket Public Access Block (party-time-staging-uploads-412381751532): operation error S3: GetPublicAccessBlock, https response error StatusCode: 403, RequestID: 1TEM1JJCX9M5FYW9, HostID: uvZEON9FGjvaOOUXfHPnDnMQKltDk2tmGVGNMuZJ6xoahKS3MfV19w27zjFs/6NvAKEWHTCZf+/nB3155Zmy5/hJoY0qhexgiw7JazoX8q0=, api error AccessDenied: User: arn:aws:sts::412381751532:assumed-role/party-time-staging-github-actions/GitHubActions is not authorized to perform: s3:GetBucketPublicAccessBlock on resource: "arn:aws:s3:::party-time-staging-uploads-412381751532" because no identity-based policy allows the s3:GetBucketPublicAccessBlock action

  with module.s3.aws_s3_bucket_public_access_block.uploads,
  on ../../modules/s3/main.tf line 99, in resource "aws_s3_bucket_public_access_block" "uploads":
  99: resource "aws_s3_bucket_public_access_block" "uploads" {


Error: reading S3 Bucket Lifecycle Configuration (party-time-staging-uploads-412381751532)

  with module.s3.aws_s3_bucket_lifecycle_configuration.uploads,
  on ../../modules/s3/main.tf line 108, in resource "aws_s3_bucket_lifecycle_configuration" "uploads":
 108: resource "aws_s3_bucket_lifecycle_configuration" "uploads" {

operation error S3: GetBucketLifecycleConfiguration, https response error
StatusCode: 403, RequestID: 1TEQX4WY09EKF0TX, HostID:
8bG5T

... (truncated)
```

</details>

*Pushed by: @guidoasbun, Action: `pull_request`*
*Workflow: https://github.com/guidoasbun/party-time/actions/runs/20249603064*